---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
source: html/2d0041c8-1cb8-354f-678f-5719797c76fc.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings

Contains deformed shape settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayDeformedShapeSettings : IDisposable
```